Tekla Open API Reference for Tekla Structures 2025
LeaderLinePlacingType Class
 The LeaderLinePlacingType class defines a placing type that places the object with a leader line.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.LeaderLinePlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class LeaderLinePlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class LeaderLinePlacingType
	Inherits PreferredPlacingTypeBase
The LeaderLinePlacingType type exposes the following members.
Constructors
Name | Description
LeaderLinePlacingType
 Creates a new leader line placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace